cmsis-svd/cmsis-svd/data/NXP/LPC18xx_svd_v18.xml
				<register>
					<name>DMAREQ1</name>
					<description>SCT DMA request 1 register</description>
					<addressOffset>0x060</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DEV_1_0</name>
							<description>If bit n is one, event n sets DMA request 1 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>DEV_1_1</name>
							<description>If bit n is one, event n sets DMA request 1 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>DEV_1_2</name>
							<description>If bit n is one, event n sets DMA request 1 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>DEV_1_3</name>
							<description>If bit n is one, event n sets DMA request 1 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>DEV_1_4</name>
							<description>If bit n is one, event n sets DMA request 1 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>DEV_1_5</name>
							<description>If bit n is one, event n sets DMA request 1 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>DEV_1_6</name>
							<description>If bit n is one, event n sets DMA request 1 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>DEV_1_7</name>
							<description>If bit n is one, event n sets DMA request 1 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>DEV_1_8</name>
							<description>If bit n is one, event n sets DMA request 1 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>DEV_1_9</name>
							<description>If bit n is one, event n sets DMA request 1 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>DEV_1_10</name>
							<description>If bit n is one, event n sets DMA request 1 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>DEV_1_11</name>
							<description>If bit n is one, event n sets DMA request 1 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>DEV_1_12</name>
							<description>If bit n is one, event n sets DMA request 1 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>DEV_1_13</name>
							<description>If bit n is one, event n sets DMA request 1 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>DEV_1_14</name>
							<description>If bit n is one, event n sets DMA request 1 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>DEV_1_15</name>
							<description>If bit n is one, event n sets DMA request 1 (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[29:16]</bitRange>
						</field>
						<field>
							<name>DRL1</name>
							<description>A 1 in this bit makes the SCT set DMA request 1 when it loads the  Match L/Unified registers from the Reload L/Unified registers.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>DRQ1</name>
							<description>This read-only bit indicates the state of DMA Request 1.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>EVEN</name>
					<description>SCT event enable register</description>
					<addressOffset>0x0F0</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>IEN0</name>
							<description>The SCT requests interrupt when bit n of this register and the event flag register are both one (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>IEN1</name>
							<description>The SCT requests interrupt when bit n of this register and the event flag register are both one (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>IEN2</name>
							<description>The SCT requests interrupt when bit n of this register and the event flag register are both one (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>IEN3</name>
							<description>The SCT requests interrupt when bit n of this register and the event flag register are both one (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>IEN4</name>
							<description>The SCT requests interrupt when bit n of this register and the event flag register are both one (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>IEN5</name>
							<description>The SCT requests interrupt when bit n of this register and the event flag register are both one (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>IEN6</name>
							<description>The SCT requests interrupt when bit n of this register and the event flag register are both one (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>IEN7</name>
							<description>The SCT requests interrupt when bit n of this register and the event flag register are both one (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>IEN8</name>
							<description>The SCT requests interrupt when bit n of this register and the event flag register are both one (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>IEN9</name>
							<description>The SCT requests interrupt when bit n of this register and the event flag register are both one (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>IEN10</name>
							<description>The SCT requests interrupt when bit n of this register and the event flag register are both one (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>IEN11</name>
							<description>The SCT requests interrupt when bit n of this register and the event flag register are both one (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>IEN12</name>
							<description>The SCT requests interrupt when bit n of this register and the event flag register are both one (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>IEN13</name>
							<description>The SCT requests interrupt when bit n of this register and the event flag register are both one (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>IEN14</name>
							<description>The SCT requests interrupt when bit n of this register and the event flag register are both one (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>IEN15</name>
							<description>The SCT requests interrupt when bit n of this register and the event flag register are both one (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>EVFLAG</name>
					<description>SCT event flag register</description>
					<addressOffset>0x0F4</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FLAG0</name>
							<description>Bit n is one if event n has occurred since reset or a 1 was last written to this bit (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>FLAG1</name>
							<description>Bit n is one if event n has occurred since reset or a 1 was last written to this bit (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>FLAG2</name>
							<description>Bit n is one if event n has occurred since reset or a 1 was last written to this bit (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>FLAG3</name>
							<description>Bit n is one if event n has occurred since reset or a 1 was last written to this bit (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>FLAG4</name>
							<description>Bit n is one if event n has occurred since reset or a 1 was last written to this bit (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>FLAG5</name>
							<description>Bit n is one if event n has occurred since reset or a 1 was last written to this bit (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>FLAG6</name>
							<description>Bit n is one if event n has occurred since reset or a 1 was last written to this bit (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>FLAG7</name>
							<description>Bit n is one if event n has occurred since reset or a 1 was last written to this bit (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>FLAG8</name>
							<description>Bit n is one if event n has occurred since reset or a 1 was last written to this bit (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>FLAG9</name>
							<description>Bit n is one if event n has occurred since reset or a 1 was last written to this bit (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>FLAG10</name>
							<description>Bit n is one if event n has occurred since reset or a 1 was last written to this bit (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>FLAG11</name>
							<description>Bit n is one if event n has occurred since reset or a 1 was last written to this bit (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>FLAG12</name>
							<description>Bit n is one if event n has occurred since reset or a 1 was last written to this bit (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>FLAG13</name>
							<description>Bit n is one if event n has occurred since reset or a 1 was last written to this bit (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>FLAG14</name>
							<description>Bit n is one if event n has occurred since reset or a 1 was last written to this bit (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>FLAG15</name>
							<description>Bit n is one if event n has occurred since reset or a 1 was last written to this bit (event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15).</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CONEN</name>
					<description>SCT conflict enable register</description>
					<addressOffset>0x0F8</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>NCEN0</name>
							<description>The SCT requests interrupt when bit n of this register and the SCT conflict flag register are both one (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>NCEN1</name>
							<description>The SCT requests interrupt when bit n of this register and the SCT conflict flag register are both one (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>NCEN2</name>
							<description>The SCT requests interrupt when bit n of this register and the SCT conflict flag register are both one (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>NCEN3</name>
							<description>The SCT requests interrupt when bit n of this register and the SCT conflict flag register are both one (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>NCEN4</name>
							<description>The SCT requests interrupt when bit n of this register and the SCT conflict flag register are both one (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>NCEN5</name>
							<description>The SCT requests interrupt when bit n of this register and the SCT conflict flag register are both one (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>NCEN6</name>
							<description>The SCT requests interrupt when bit n of this register and the SCT conflict flag register are both one (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>NCEN7</name>
							<description>The SCT requests interrupt when bit n of this register and the SCT conflict flag register are both one (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>NCEN8</name>
							<description>The SCT requests interrupt when bit n of this register and the SCT conflict flag register are both one (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>NCEN9</name>
							<description>The SCT requests interrupt when bit n of this register and the SCT conflict flag register are both one (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>NCEN10</name>
							<description>The SCT requests interrupt when bit n of this register and the SCT conflict flag register are both one (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>NCEN11</name>
							<description>The SCT requests interrupt when bit n of this register and the SCT conflict flag register are both one (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>NCEN12</name>
							<description>The SCT requests interrupt when bit n of this register and the SCT conflict flag register are both one (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>NCEN13</name>
							<description>The SCT requests interrupt when bit n of this register and the SCT conflict flag register are both one (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>NCEN14</name>
							<description>The SCT requests interrupt when bit n of this register and the SCT conflict flag register are both one (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>NCEN15</name>
							<description>The SCT requests interrupt when bit n of this register and the SCT conflict flag register are both one (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
