cmsis-svd/cmsis-svd/data/NXP/LPC18xx_svd_v18.xml
						</field>
						<field>
							<name>HEVENT</name>
							<description>Select L/H counter. Do not set this bit if UNIFY = 1.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SELECTS_THE_L_STATE_</name>
									<description>Selects the L state and the L match register selected by MATCHSEL.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SELECTS_THE_H_STATE_</name>
									<description>Selects the H state and the H match register selected by MATCHSEL.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OUTSEL</name>
							<description>Input/output select</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SELECTS_THE_OUTPUT_S</name>
									<description>Selects the output selected by IOSEL.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SELECTS_THE_INPUT_SE</name>
									<description>Selects the input selected by IOSEL.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IOSEL</name>
							<description>Selects the input or output signal associated with this event (if  any). If CKMODE is 1x, the clock input is an implicit ingredient of  every event, and should not be selected in this register.</description>
							<bitRange>[9:6]</bitRange>
							
						</field>
						<field>
							<name>IOCOND</name>
							<description>Selects the I/O condition for event n. (Note that the detection of edges on outputs will lag the conditions that switch the outputs by one SCT clock). An input must have a minimum pulse width of at least one SCT  clock period in order to guarantee proper edge/state detection.</description>
							<bitRange>[11:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LOW</name>
									<description>LOW</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISE</name>
									<description>Rise</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALL</name>
									<description>Fall</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>HIGH</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>COMBMODE</name>
							<description>Selects how the specified match and I/O condition are used and combined.</description>
							<bitRange>[13:12]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>OR_THE_EVENT_OCCURS</name>
									<description>OR. The event occurs when either the specified match or I/O condition occurs.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MATCH_USES_THE_SPEC</name>
									<description>MATCH. Uses the specified match only.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IO_USES_THE_SPECIFI</name>
									<description>IO. Uses the specified I/O condition only.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AND_THE_EVENT_OCCUR</name>
									<description>AND. The event occurs when the specified match and I/O condition occur simultaneously.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STATELD</name>
							<description>This bit controls how the STATEV value modifies the state  selected by HEVENT when this event is the highest-numbered  event occurring for that state.</description>
							<bitRange>[14:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>STATEV_VALUE_IS_ADDE</name>
									<description>STATEV value is added into STATE (the carry-out is ignored).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STATEV_VALUE_IS_LOAD</name>
									<description>STATEV value is loaded into STATE.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STATEV</name>
							<description>This value is loaded into or added to the state selected by  HEVENT, depending on STATELD, when this event is the  highest-numbered event occurring for that state. If STATELD and  STATEV are both zero, there is no change to the STATE value.</description>
							<bitRange>[19:15]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:20]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<dim>16</dim>
					<dimIncrement>0x08</dimIncrement>
					<dimIndex>0-15</dimIndex>
					<name>OUTPUTSET%s</name>
					<description>SCT output set register</description>
					<addressOffset>0x500</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SETn0</name>
							<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>SETn1</name>
							<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>SETn2</name>
							<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>SETn3</name>
							<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[3:3]</bitRange>

