cmsis-svd/cmsis-svd/data/NXP/LPC18xx_svd_v18.xml
				<register>
					<dim>8</dim>
					<dimIncrement>0x20</dimIncrement>
					<dimIndex>0-7</dimIndex>
					<name>C%sCONFIG</name>
					<description>DMA Channel Configuration Register</description>
					<addressOffset>0x110</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>E</name>
							<description>Channel enable. Reading this bit indicates whether a channel is currently enabled or disabled: The Channel Enable bit status can also be found by reading the EnbldChns Register. A channel can be disabled by clearing the Enable bit. This causes the current AHB transfer (if one is in progress) to complete and the channel is then disabled. Any data in the FIFO of the relevant channel is lost. Restarting the channel by setting the Channel Enable bit has unpredictable effects, the channel must be fully re-initialized. The channel is also disabled, and Channel Enable bit cleared, when the last LLI is reached, the DMA transfer is completed, or if a channel error is encountered. If a channel must be disabled without losing data in the FIFO, the Halt bit must be set so that further DMA requests are ignored. The Active bit must then be polled until it reaches 0, indicating that there is no data left in the FIFO. Finally, the Channel Enable bit can be cleared.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CHANNEL_DISABLED_</name>
									<description>Channel disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CHANNEL_ENABLED_</name>
									<description>Channel enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRCPERIPHERAL</name>
							<description>Source peripheral. This value selects the DMA source request peripheral. This field is ignored if the source of the transfer is from memory. See Table 136 for details.</description>
							<bitRange>[5:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SOURCE_EQ_SPIFI</name>
									<description>Source = SPIFI</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_TIMER_0_MAT</name>
									<description>Source = Timer 0 match 0/UART0 transmit</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_TIMER_0_MAT</name>
									<description>Source = Timer 0 match 1/UART0 receive</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_TIMER_1_MAT</name>
									<description>Source = Timer 1 match 0/UART1 transmit</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_TIMER_1_MAT</name>
									<description>Source = Timer 1 match 1/UART 1 receive</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_TIMER_2_MAT</name>
									<description>Source = Timer 2 match 0/UART 2 transmit</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_TIMER_2_MAT</name>
									<description>Source = Timer 2 match 1/UART 2 receive</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_TIMER_3_MAT</name>
									<description>Source = Timer 3 match 0/UART3 transmit/SCT DMA request 0</description>
									<value>0x7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_TIMER_3_MAT</name>
									<description>Source = Timer 3 match 1/UART3 receive/SCT DMA request 1</description>
									<value>0x8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_SSP0_RECEIV</name>
									<description>Source = SSP0 receive/I2S channel 0</description>
									<value>0x9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_SSP0_TRANSM</name>
									<description>Source = SSP0 transmit/I2S channel 1</description>
									<value>0xA</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_SSP1_RECEIV</name>
									<description>Source = SSP1 receive</description>
									<value>0xB</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_SSP1_TRANSM</name>
									<description>Source = SSP1 transmit</description>
									<value>0xC</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_ADC0</name>
									<description>Source = ADC0</description>
									<value>0xD</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_ADC1</name>
									<description>Source = ADC1</description>
									<value>0xE</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_EQ_DAC</name>
									<description>Source = DAC</description>
									<value>0xF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DESTPERIPHERAL</name>
							<description>Destination peripheral. This value selects the DMA destination request peripheral. This field is ignored if the destination of the transfer is to memory. See Table 136 for details.</description>
							<bitRange>[10:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DESTINATION_EQ_SPIFI</name>
									<description>Destination = SPIFI</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_TIMER_</name>
									<description>Destination = Timer 0 match 0/UART0 transmit</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_TIMER_</name>
									<description>Destination = Timer 0 match 1/UART0 receive</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_TIMER_</name>
									<description>Destination = Timer 1 match 0/UART1 transmit</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_TIMER_</name>
									<description>Destination = Timer 1 match 1/UART 1 receive</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_TIMER_</name>
									<description>Destination = Timer 2 match 0/UART 2 transmit</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_TIMER_</name>
									<description>Destination = Timer 2 match 1/UART 2 receive</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_TIMER_</name>
									<description>Destination = Timer 3 match 0/UART3 transmit/SCT DMA request 0</description>
									<value>0x7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_TIMER_</name>
									<description>Destination = Timer 3 match 1/UART3 receive/SCT DMA request 1</description>
									<value>0x8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_SSP0_R</name>
									<description>Destination = SSP0 receive/I2S channel 0</description>
									<value>0x9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_SSP0_T</name>
									<description>Destination = SSP0 transmit/I2S channel 1</description>
									<value>0xA</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_SSP1_R</name>
									<description>Destination = SSP1 receive</description>
									<value>0xB</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_SSP1_T</name>
									<description>Destination = SSP1 transmit</description>
									<value>0xC</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_ADC0</name>
									<description>Destination = ADC0</description>
									<value>0xD</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_ADC1</name>
									<description>Destination = ADC1</description>
									<value>0xE</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESTINATION_EQ_DAC</name>
									<description>Destination = DAC</description>
									<value>0xF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FLOWCNTRL</name>
							<description>Flow control and transfer type. This value indicates the flow controller and transfer type. The flow controller can be the DMA Controller, the source peripheral, or the destination peripheral. The transfer type can be memory-to-memory, memory-to-peripheral, peripheral-to-memory, or peripheral-to-peripheral. Refer to Table 157 for the encoding of this field.</description>
							<bitRange>[13:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MEMORY_TO_MEMORY_(DM</name>
									<description>Memory to memory (DMA control)</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MEMORY_TO_PERIPHERAL</name>
									<description>Memory to peripheral (DMA control)</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PERIPHERAL_TO_MEMORY</name>
									<description>Peripheral to memory (DMA control)</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_PERIPHERAL_TO</name>
									<description>Source peripheral to destination peripheral (DMA control)</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_PERIPHERAL_TO</name>
									<description>Source peripheral to destination peripheral (destination control)</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MEMORY_TO_PERIPHERAL</name>
									<description>Memory to peripheral (peripheral control)</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PERIPHERAL_TO_MEMORY</name>
									<description>Peripheral to memory (peripheral control)</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOURCE_PERIPHERAL_TO</name>
									<description>Source peripheral to destination peripheral (source control)</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IE</name>
							<description>Interrupt error mask. When cleared, this bit masks out the error interrupt of the relevant channel.</description>
							<bitRange>[14:14]</bitRange>
							
