cmsis-svd/cmsis-svd/data/NXP/LPC18xx_svd_v18.xml
						</field>
						<field>
							<name>CARD_VOLTAGE_A</name>
							<description>Card regulator-A voltage setting; output to card_volt_a port.
Optional feature; ports can be used as general-purpose outputs.</description>
							<bitRange>[19:16]</bitRange>
							
						</field>
						<field>
							<name>CARD_VOLTAGE_B</name>
							<description>Card regulator-B voltage setting; output to card_volt_b port.
Optional feature; ports can be used as general-purpose outputs.</description>
							<bitRange>[23:20]</bitRange>
							
						</field>
						<field>
							<name>ENABLE_OD_PULLUP</name>
							<description>External open-drain pullup. Inverted value of this bit is output to ccmd_od_pullup_en_n port. When
bit is set, command output always driven in open-drive mode; that is,
DWC_mobile_storage drives either 0 or high impedance, and does not
drive hard 1.</description>
							<bitRange>[24:24]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USE_INTERNAL_DMAC</name>
							<description>Present only for the Internal DMAC configuration; else, it is reserved.</description>
							<bitRange>[25:25]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>HOST</name>
									<description>The host performs data transfers through the slave interface</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DMAC</name>
									<description>Internal DMAC used for data transfer</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:26]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>PWREN</name>
					<description>Power Enable Register</description>
					<addressOffset>0x04</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>POWER_ENABLE</name>
							<description>Power on/off switch for up to 16 cards; for example, bit[0] controls card 0.
Once power is turned on, firmware should wait for regulator/switch ramp-up
time before trying to initialize card.
0 - power off
1 - power on
Only NUM_CARDS number of bits are implemented.
Bit values output to card_power_en port.
Optional feature; ports can be used as general-purpose outputs.</description>
							<bitRange>[29:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:30]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CLKDIV</name>
					<description>Clock Divider Register</description>
					<addressOffset>0x08</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CLK_DIVIDER0</name>
							<description>Clock divider-0 value. Clock division is 2*n. For example, value of 0 means
divide by 2*0 = 0 (no division, bypass), value of 1 means divide by 2*1 = 2,
value of  ff  means divide by 2*255 = 510, and so on.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>CLK_DIVIDER1</name>
							<description>Clock divider-1 value. Clock division is 2*n. For example, value of 0 means
divide by 2*0 = 0 (no division, bypass), value of 1 means divide by 2*1 = 2,
value of  ff  means divide by 2*255 = 510, and so on.
In MMC-Ver3.3-only mode, bits not implemented because only one clock
divider is supported.</description>
							<bitRange>[15:8]</bitRange>
						</field>
						<field>
							<name>CLK_DIVIDER2</name>
							<description>Clock divider-2 value. Clock division is 2*n. For example, value of 0 means
divide by 2*0 = 0 (no division, bypass), value of 1 means divide by 2*1 = 2,
value of  ff  means divide by 2*255 = 510, and so on.
In MMC-Ver3.3-only mode, bits not implemented because only one clock
divider is supported.</description>
							<bitRange>[23:16]</bitRange>
						</field>
						<field>
							<name>CLK_DIVIDER3</name>
							<description>Clock divider-3 value. Clock division is 2*n. For example, value of 0 means
divide by 2*0 = 0 (no division, bypass), a value of 1 means divide by 2*1 = 2, a
value of  ff  means divide by 2*255 = 510, and so on.
In MMC-Ver3.3-only mode, bits not implemented because only one clock
divider is supported.
divide by 2*0 = 0 (no division, bypass), value of 1 means divide by 2*1 = 2,
value of  ff  means divide by 2*255 = 510, and so on.
In MMC-Ver3.3-only mode, bits not implemented because only one clock
divider is supported.</description>
							<bitRange>[31:24]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CLKSRC</name>
					<description>SD Clock Source Register</description>
					<addressOffset>0x0C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CLK_SOURCE</name>
							<description>Clock divider source for up to 16 SD cards supported. Each card has two bits
assigned to it. For example, bits[1:0] assigned for card-0, which maps and internally
routes clock divider[3:0] outputs to cclk_out[15:0] pins, depending on bit value.
00 - Clock divider 0
01 - Clock divider 1
10 - Clock divider 2
11 - Clock divider 3
In MMC-Ver3.3-only controller, only one clock divider supported. The cclk_out is
always from clock divider 0, and this register is not implemented.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CLKENA</name>
					<description>Clock Enable Register</description>
					<addressOffset>0x10</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CCLK_ENABLE</name>
							<description>Low-power control for up to 16 SD card clocks and one MMC card clock
supported.
0 - Non-low-power mode
1 - Low-power mode; stop clock when card in IDLE (should be
normally set to only MMC and SD memory cards; for SDIO cards,
if interrupts must be detected, clock should not be stopped).
In MMC-Ver3.3-only mode, since there is only one cclk_out, only
cclk_low_power[0] is used.
supported.
0 - Clock disabled
1 - Clock enabled
In MMC-Ver3.3-only mode, since there is only one cclk_out, only
cclk_enable[0] is used.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>CCLK_LOW_POWER</name>
							<description>Clock-enable control for up to 16 SD card clocks and one MMC card clock
supported.
0 - Clock disabled
1 - Clock enabled
In MMC-Ver3.3-only mode, since there is only one cclk_out, only
cclk_enable[0] is used.
supported.
0 - Non-low-power mode
1 - Low-power mode; stop clock when card in IDLE (should be
normally set to only MMC and SD memory cards; for SDIO cards,
if interrupts must be detected, clock should not be stopped).
In MMC-Ver3.3-only mode, since there is only one cclk_out, only
cclk_low_power[0] is used.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>TMOUT</name>
					<description>Timeout Register</description>
					<addressOffset>0x14</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RESPONSE_TIMEOUT</name>
							<description>Response timeout value.
Value is in number of card output clocks - cclk_out.
Value is in number of card output clocks - cclk_out.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>DATA_TIMEOUT</name>
							<description>Value for card Data Read Timeout; same value also used for Data
Starvation by Host timeout.
Value is in number of card output clocks - cclk_out of selected card.
Starvation by Host timeout.
Value is in number of card output clocks - cclk_out of selected card.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CTYPE</name>
					<description>Card Type Register</description>
					<addressOffset>0x18</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CARD_WIDTH0</name>
							<description>One bit per card indicates if card is 1-bit or 4-bit:
0 - 1-bit mode
1 - 4-bit mode
Bit[15] corresponds to card[15], bit[0] corresponds to card[0].
Only NUM_CARDS*2 number of bits are implemented.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>CARD_WIDTH1</name>
							<description>One bit per card indicates if card is 8-bit:
0 - Non 8-bit mode
1 - 8-bit mode
Bit[31] corresponds to card[15]; bit[16] corresponds to card[0].</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>BLKSIZ</name>
					<description>Block Size Register</description>
					<addressOffset>0x1C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>BLOCK_SIZE</name>
							<description>Block size</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>BYTCNT</name>
					<description>Byte Count Register</description>
					<addressOffset>0x20</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>BYTE_COUNT</name>
							<description>Number of bytes to be transferred; should be integer multiple of Block Size for
block transfers.
For undefined number of byte transfers, byte count should be set to 0. When byte
count is set to 0, it is responsibility of host to explicitly send stop/abort command
to terminate data transfer.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INTMASK</name>
					<description>Interrupt Mask Register</description>
					<addressOffset>0x24</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CDET</name>
							<description>Card detect. Bits used to mask unwanted interrupts. Value of 0 masks interrupt; value of 1
enables interrupt.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RE</name>
							<description>Response error. Bits used to mask unwanted interrupts. Value of 0 masks interrupt; value of 1
enables interrupt.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>CDONE</name>
							<description>Command done. Bits used to mask unwanted interrupts. Value of 0 masks interrupt; value of 1
enables interrupt.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>DTO</name>
							<description>Data transfer over. Bits used to mask unwanted interrupts. Value of 0 masks interrupt; value of 1
enables interrupt.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>TXDR</name>
							<description>Transmit FIFO data request. Bits used to mask unwanted interrupts. Value of 0 masks interrupt; value of 1
enables interrupt.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RXDR</name>
							<description>Receive FIFO data request. Bits used to mask unwanted interrupts. Value of 0 masks interrupt; value of 1
enables interrupt.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RCRC</name>
							<description>Response CRC error. Bits used to mask unwanted interrupts. Value of 0 masks interrupt; value of 1
enables interrupt.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>DCRC</name>
							<description>Data CRC error. Bits used to mask unwanted interrupts. Value of 0 masks interrupt; value of 1
enables interrupt.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RTO</name>
							<description>Response timeout. Bits used to mask unwanted interrupts. Value of 0 masks interrupt; value of 1
enables interrupt.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>DRTO</name>
							<description>Data read timeout. Bits used to mask unwanted interrupts. Value of 0 masks interrupt; value of 1
enables interrupt.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>HTO</name>
							<description>Data starvation-by-host timeout (HTO) /Volt_switch_int. Bits used to mask unwanted interrupts. Value of 0 masks interrupt; value of 1
enables interrupt.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>FRUN</name>
							<description>FIFO underrun/overrun error. Bits used to mask unwanted interrupts. Value of 0 masks interrupt; value of 1
enables interrupt.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>HLE</name>
							<description>Hardware locked write error. Bits used to mask unwanted interrupts. Value of 0 masks interrupt; value of 1
enables interrupt.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>SBE</name>
							<description>Start-bit error. Bits used to mask unwanted interrupts. Value of 0 masks interrupt; value of 1
enables interrupt.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>ACD</name>
							<description>Auto command done. Bits used to mask unwanted interrupts. Value of 0 masks interrupt; value of 1
enables interrupt.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>EBE</name>
							<description>End-bit error (read)/Write no CRC. Bits used to mask unwanted interrupts. Value of 0 masks interrupt; value of 1
enables interrupt.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>SDIO_INT_MASK</name>
							<description>Mask SDIO interrupts
One bit for each card. Bit[31] corresponds to card[15], and bit[16] corresponds to
card[0]. When masked, SDIO interrupt detection for that card is disabled.
A 0 masks an interrupt, and 1 enables an interrupt.
In MMC-Ver3.3-only mode, these bits are always 0.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CMDARG</name>
					<description>Command Argument Register</description>
					<addressOffset>0x28</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CMD_ARG</name>
							<description>Value indicates command argument to be passed to card.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CMD</name>
					<description>Command Register</description>
					<addressOffset>0x2C</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CMD_INDEX</name>
							<description>Command index</description>
							<bitRange>[5:0]</bitRange>
							
