cmsis-svd/cmsis-svd/data/NXP/LPC18xx_svd_v18.xml
				<register>
					<name>MAC_VLAN_TAG</name>
					<description>VLAN tag register</description>
					<addressOffset>0x001C</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VL</name>
							<description>VLAN Tag Identifier for Receive Frames  This contains the 802.1Q VLAN tag to identify VLAN frames, and is compared to the fifteenth and sixteenth bytes of the frames being received for VLAN frames. Bits[15:13] are the User Priority, Bit[12] is the Canonical Format Indicator (CFI) and bits[11:0] are the VLAN tag's VLAN Identifier (VID) field. When the ETV bit is set, only the VID (Bits[11:0]) is used for comparison.  If VL (VL[11:0] if ETV is set) is all zeros, the MAC does not check the fifteenth and sixteenth bytes for VLAN tag comparison, and declares all frames with a Type field value of 0x8100 to be VLAN frames.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>ETV</name>
							<description>Enable 12-Bit VLAN Tag Comparison  When this bit is set, a 12-bit VLAN identifier, rather than the complete 16-bit VLAN tag, is used for comparison and filtering. Bits[11:0] of the VLAN tag are compared with the corresponding field in the received VLAN-tagged frame.  When this bit is reset, all 16 bits of the received VLAN frame's fifteenth and sixteenth bytes are used for comparison.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:17]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_DEBUG</name>
					<description>Debug register</description>
					<addressOffset>0x0024</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXIDLESTAT</name>
							<description>When high, it indicates that the MAC MII receive protocol engine is actively receiving data and not in IDLE state.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>FIFOSTAT0</name>
							<description>When high, it indicates the active state of the small FIFO Read and Write controllers respectively of the MAC receive Frame Controller module.</description>
							<bitRange>[2:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RXFIFOSTAT1</name>
							<description>When high, it indicates that the MTL RxFIFO Write Controller is active and transferring a received frame to the FIFO.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RXFIFOSTAT</name>
							<description>State of the RxFIFO read Controller:  00 = idle state 01 = reading frame data 10 = reading frame status (or time stamp) 11 = flushing the frame data and status</description>
							<bitRange>[6:5]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RXFIFOLVL</name>
							<description>Status of the RxFIFO Fill-level  00 = RxFIFO Empty  01 = RxFIFO fill-level below flow-control de-activate threshold  10 = RxFIFO fill-level above flow-control activate threshold  11 = RxFIFO Full</description>
							<bitRange>[9:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[15:10]</bitRange>
						</field>
						<field>
							<name>TXIDLESTAT</name>
							<description>When high, it indicates that the MAC MII transmit protocol engine is actively transmitting data and not in IDLE state.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>TXSTAT</name>
							<description>State of the MAC Transmit Frame Controller module:  00 = idle 01 = Waiting for Status of previous frame or IFG/backoff period to be over  10 = Generating and transmitting a PAUSE control frame (in full duplex mode)  11 = Transferring input frame for transmission</description>
							<bitRange>[18:17]</bitRange>
						</field>
						<field>
							<name>PAUSE</name>
							<description>When high, it indicates that the MAC transmitter is in PAUSE condition (in full-duplex only) and hence will not schedule any frame for transmission.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>TXFIFOSTAT</name>
							<description>State of the TxFIFO read Controller  00 = idle state 01 = READ state (transferring data to MAC transmitter)  10 = Waiting for TxStatus from MAC transmitter  11 = Writing the received TxStatus or flushing the TxFIFO</description>
							<bitRange>[21:20]</bitRange>
						</field>
						<field>
							<name>TXFIFOSTAT1</name>
							<description>When high, it indicates that the MTL TxFIFO Write Controller is active and transferring data to the TxFIFO.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>TXFIFOLVL</name>
							<description>When high, it indicates that the MTL TxFIFO is not empty and has some data left for transmission.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>TXFIFOFULL</name>
							<description>When high, it indicates that the MTL TxStatus FIFO is full and hence the MTL will not be accepting any more frames for transmission.</description>
							<bitRange>[25:25]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_RWAKE_FRFLT</name>
					<description>Remote wake-up frame filter</description>
					<addressOffset>0x0028</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>WKUPFMFILTER address</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_PMT_CTRL_STAT</name>
					<description>PMT control and status</description>
					<addressOffset>0x002C</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PD</name>
							<description>Power-down When set, all received frames will be dropped. This bit is cleared automatically when a magic packet or Wake-Up frame is received, and Power-Down mode is disabled. Frames received after this bit is cleared are forwarded to the application.This bit must only be set when either the Magic Packet Enable or Wake- Up Frame Enable bit is set high.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>MPE</name>
							<description>Magic packet enable When set, enables generation of a power management event due to Magic Packet reception.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>WFE</name>
							<description>Wake-up frame enable When set, enables generation of a power management event due to wake-up frame reception.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[4:3]</bitRange>
						</field>
						<field>
							<name>MPR</name>
							<description>Magic Packet Received When set, this bit indicates the power management event was generated by the reception of a Magic Packet. This bit is cleared by a Read into this register.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>WFR</name>
							<description>Wake-up Frame Received When set, this bit indicates the power management event was generated due to reception of a wake-up frame. This bit is cleared by a Read into this register.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[8:7]</bitRange>
						</field>
						<field>
							<name>GU</name>
							<description>Global Unicast When set, enables any unicast packet filtered by the MAC (DAF) address recognition to be a wake-up frame.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[30:10]</bitRange>
						</field>
						<field>
							<name>WFFRPR</name>
							<description>Wake-up Frame Filter Register Pointer Reset When set, resets the Remote Wake-up Frame Filter register pointer to 000. It is automatically cleared after 1 clock cycle.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_INTR</name>
					<description>Interrupt status register</description>
					<addressOffset>0x0038</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_INTR_MASK</name>
					<description>Interrupt mask register</description>
					<addressOffset>0x003C</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>PMTMSK</name>
							<description>PMT Interrupt Mask  This bit when set, will disable the assertion of the interrupt signal due to the setting of PMT Interrupt Status bit in Table 327.</description>
							<bitRange>[3:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDR0_HIGH</name>
					<description>MAC address 0 high register</description>
					<addressOffset>0x0040</addressOffset>
					<access>read-write</access>
					<resetValue>0x8000FFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>A47_32</name>
							<description>MAC Address0 [47:32]  This field contains the upper 16 bits (47:32) of the 6-byte first MAC address. This is used by the MAC for filtering for received frames and for inserting the MAC address in the Transmit Flow Control (PAUSE) Frames.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[30:16]</bitRange>
						</field>
						<field>
							<name>MO</name>
							<description>Always 1</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDR0_LOW</name>
					<description>MAC address 0 low register</description>
					<addressOffset>0x0044</addressOffset>
					<access>read-write</access>
					<resetValue>0xFFFFFFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>A31_0</name>
							<description>MAC Address0 [31:0]  This field contains the lower 32 bits of the 6-byte first MAC address. This is used by the MAC for filtering for received frames and for inserting the MAC address in the Transmit Flow Control (PAUSE) Frames.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_TIMESTP_CTRL</name>
					<description>Time stamp control register</description>
					<addressOffset>0x0700</addressOffset>
					<access>read-write</access>
					<resetValue>0x00002000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TSENA</name>
							<description>Time Stamp Enable  When this bit, is set the timestamping is enabled for transmit and receive frames. When disabled timestamp is not added for transmit and receive frames and the TimeStamp Generator is also suspended. User has to always initialize the TimeStamp (system time) after enabling this mode.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>TSCFUPDT</name>
							<description>Time Stamp Fine or Coarse Update  When set, indicates that the system times update to be done using fine update method. When reset it indicates the system time stamp update to be done using Coarse method. This bit is reserved if the fine correction option is not enabled.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>TSINIT</name>
							<description>Time Stamp Initialize  When set, the system time is initialized (over-written) with the value specified in the Time Stamp High Update and Time Stamp Low Update registers. This register bit should be read zero before updating it. This bit is reset once the initialize is complete.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>TSUPDT</name>
							<description>Time Stamp Update  When set, the system time is updated (added/subtracted) with the value specified in the Time Stamp High Update and Time Stamp Low Update registers. This register bit should be read zero before updating it. This bit is reset once the update is completed in hardware.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>TSTRIG</name>
							<description>Time Stamp Interrupt Trigger Enable  When set, the Time Stamp interrupt is generated when the System Time becomes greater than the value written in Target Time register. This bit is reset after the generation of Time Stamp Trigger Interrupt.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>TSADDREG</name>
							<description>Addend Reg Update  When set, the contents of the Time Stamp Addend register is updated in the PTP block for fine correction. This is cleared when the update is completed. This register bit should be zero before setting it. This is a reserved bit when only coarse correction option is selected.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[7:6]</bitRange>
						</field>
						<field>
							<name>TSENALL</name>
							<description>Enable Time Stamp for All Frames  When set, the time stamp snapshot is enabled for all frames received by the core.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>TSCTRLSSR</name>
							<description>Time Stamp Digital or Binary rollover control  When set, the Time Stamp Low register rolls over after 0x3B9A_C9FF value (i.e., 1 nanosecond accuracy) and increments the Time Stamp (High) seconds. When reset, the rollover value of sub-second register is 0x7FFF_FFFF. The sub-second increment has to be programmed correctly depending on the PTP reference clock frequency and this bit value.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>TSVER2ENA</name>
							<description>Enable PTP packet snooping for version 2 format  When set, the PTP packets are snooped using the 1588 version 2 format else snooped using the version 1 format.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>TSIPENA</name>
							<description>Enable Time Stamp Snapshot for PTP over Ethernet frames  When set, the time stamp snapshot is taken for frames which have PTP messages in Ethernet frames (PTP over Ethernet) also. By default snapshots are taken for UDP-IP-Ethernet PTP packets.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>TSIPV6ENA</name>
							<description>Enable Time Stamp Snapshot for IPv6 frames  When set, the time stamp snapshot is taken for IPv6 frames.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>TSIPV4ENA</name>
							<description>Enable Time Stamp Snapshot for IPv4 frames  When set, the time stamp snapshot is taken for IPv4 frames.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>TSEVNTENA</name>
							<description>Enable Time Stamp Snapshot for Event Messages  When set, the time stamp snapshot is taken for event messages only . When reset snapshot is taken for all other messages except Announce, Management and Signaling.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>TSMSTRENA</name>
							<description>Enable Snapshot for Messages Relevant to Master  When set, the snapshot is taken for messages relevant to master node only else snapshot is taken for messages relevant to slave node. This is valid only for ordinary clock and boundary clock node.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>TSCLKTYPE</name>
							<description>Select the type of clock node  The following are the options to select the type of clock node:  00 = ordinary clock 01 = boundary clock 10 = end-to-end transparent clock 11 = peer-to-peer transparent clock</description>
							<bitRange>[17:16]</bitRange>
						</field>
						<field>
							<name>TSENMACADDR</name>
							<description>Enable MAC address for PTP frame filtering  When set, uses the DA MAC address (that matches any MAC Address register except the default MAC address 0) to filter the PTP frames when PTP is sent directly over Ethernet.</description>
							<bitRange>[18:18]</bitRange>
						</field>
					</fields>
				</register>
