cmsis-svd/cmsis-svd/data/NXP/LPC18xx_svd_v18.xml
			</registers>
		</peripheral>
		<peripheral>
			<name>PMC</name>
			<description>Product name title=UM10430 Chapter title=LPC18xx Power Management Controller (PMC) Modification date=1/20/2011 Major revision=0 Minor revision=7 </description>
			<groupName>PMC</groupName>
			<baseAddress>0x40042000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>PD0_SLEEP0_HW_ENA</name>
					<description>Hardware sleep event enable register</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ENA_EVENT0</name>
							<description>Writing a 1 enables any sleep modes for Cortex-M3.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:1]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PD0_SLEEP0_MODE</name>
					<description>Sleep power mode register</description>
					<addressOffset>0x01C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PWR_STATE</name>
							<description>Selects between Deep-sleep, Power-down, and Deep power-down modes. Only one of the following three values can be programmed in this register: 0x003F 00AA = Deep-sleep mode 0x003F FCBA = Power-down mode 0x003F FF7F = Deep power-down mode</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
	<name>CREG</name>
	<description>Product name title=UM10430 Chapter title=LPC18xx Configuration Registers (CREG) Modification date=8/19/2011 Major revision=0 Minor revision=14 </description>
	<groupName>CREG</groupName>
	<baseAddress>0x40043000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<registers>
		<register>
			<name>IRCTRM</name>
			<description>IRC trim register</description>
			<addressOffset>0x000</addressOffset>
			<access>read-only</access>
			<resetValue>0x000FF2BC</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TRM</name>
					<description>IRC trim value</description>
					<bitRange>[11:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[19:12]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:20]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CREG0</name>
			<description>Chip configuration register 32 kHz oscillator output and BOD control register.</description>
			<addressOffset>0x004</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>EN1KHZ</name>
					<description>Enable 1 kHz output.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>1_KHZ_OUTPUT_DISABLE</name>
							<description>1 kHz output disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>1_KHZ_OUTPUT_ENABLED</name>
							<description>1 kHz output enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EN32KHZ</name>
					<description>Enable 32 kHz output</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>32_KHZ_OUTPUT_DISABL</name>
							<description>32 kHz output disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>32_KHZ_OUTPUT_ENABLE</name>
							<description>32 kHz output enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESET32KHZ</name>
					<description>32 kHz oscillator reset</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>TBD</name>
							<description>TBD</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TBD</name>
							<description>TBD</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>32KHZPD</name>
					<description>32 kHz power control.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ON</name>
							<description>32 kHz oscillator powered.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OFF</name>
							<description>32 kHz oscillator powered-down.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[4:4]</bitRange>
					
				</field>
				<field>
					<name>USB0PHY</name>
					<description>USB0 PHY power control.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ON</name>
							<description>USB0 PHY powered.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OFF</name>
							<description>USB0 PHY powered down.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ALARMCTRL</name>
					<description>RTC_ALARM pin output control</description>
					<bitRange>[7:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RTC_ALARM_</name>
							<description>RTC alarm.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>EVENT_ROUTER_EVENT_</name>
							<description>Event router event.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INACTIVE_</name>
							<description>Inactive.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>BODLVL1</name>
					<description>BOD trip level to generate an interrupt.</description>
					<bitRange>[9:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>2_75_V</name>
							<description>2.75 V</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>2_85_V</name>
							<description>2.85 V</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>2_95_V</name>
							<description>2.95 V</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>3_05_V</name>
							<description>3.05 V</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>BODLVL2</name>
					<description>BOD trip level to generate a reset.</description>
					<bitRange>[11:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>1_70_V</name>
							<description>1.70 V</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>1_80_V</name>
							<description>1.80 V</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>1_90_V</name>
							<description>1.90 V</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>2_00_V</name>
							<description>2.00 V</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[13:12]</bitRange>
					
