cmsis-svd/cmsis-svd/data/NXP/LPC18xx_svd_v18.xml
						</field>
						<field>
							<name>CAN_L</name>
							<description>Level detect mode for C_CAN event.</description>
							<bitRange>[12:12]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DETECT_LOW_LEVEL_IF_</name>
									<description>Detect LOW level if bit 12 in the EDGE register is 0. Detect falling edge if bit 12 in the EDGE register is 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DETECT_HIGH_LEVEL_IF</name>
									<description>Detect HIGH level if bit 12 in the EDGE register is 0. Detect rising edge if bit 12 in the EDGE register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIM2_L</name>
							<description>Level detect mode for combined timer output 2 event.</description>
							<bitRange>[13:13]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DETECT_LOW_LEVEL_IF_</name>
									<description>Detect LOW level if bit 13 in the EDGE register is 0. Detect falling edge if bit 13 in the EDGE register is 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DETECT_HIGH_LEVEL_IF</name>
									<description>Detect HIGH level if bit 13 in the EDGE register is 0. Detect rising edge if bit 13 in the EDGE register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIM6_L</name>
							<description>Level detect mode for combined timer output 6 event.</description>
							<bitRange>[14:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DETECT_LOW_LEVEL_IF_</name>
									<description>Detect LOW level if bit 14 in the EDGE register is 0. Detect falling edge if bit 14 in the EDGE register is 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DETECT_HIGH_LEVEL_IF</name>
									<description>Detect HIGH level if bit 14 in the EDGE register is 0. Detect rising edge if bit 14 in the EDGE register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>QEI_L</name>
							<description>Level detect mode for QEI event.</description>
							<bitRange>[15:15]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DETECT_LOW_LEVEL_IF_</name>
									<description>Detect LOW level if bit 15 in the EDGE register is 0. Detect falling edge if bit 15 in the EDGE register is 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DETECT_HIGH_LEVEL_IF</name>
									<description>Detect HIGH level if bit 15 in the EDGE register is 0. Detect rising edge if bit 15 in the EDGE register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIM14_L</name>
							<description>Level detect mode for combined timer output 14 event.</description>
							<bitRange>[16:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DETECT_LOW_LEVEL_IF_</name>
									<description>Detect LOW level if bit 16 in the EDGE register is 0. Detect falling edge if bit 16 in the EDGE register is 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DETECT_HIGH_LEVEL_IF</name>
									<description>Detect HIGH level if bit 16 in the EDGE register is 0. Detect rising edge if bit 16 in the EDGE register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[18:17]</bitRange>
							
						</field>
						<field>
							<name>RESET_L</name>
							<description>Level detect mode for RESET event.</description>
							<bitRange>[19:19]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DETECT_LOW_LEVEL_IF_</name>
									<description>Detect LOW level if bit 17 in the EDGE register is 0. Detect falling edge if bit 17 in the EDGE register is 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DETECT_HIGH_LEVEL_IF</name>
									<description>Detect HIGH level if bit 17 in the EDGE register is 0. Detect rising edge if bit 17 in the EDGE register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:20]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>EDGE</name>
					<description>Edge configuration</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0x000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WAKEUP0_E</name>
							<description>Edge detect mode for WAKEUP0 event.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LEVEL_DETECT_</name>
									<description>Level detect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EDGE_DETECT_DETECT_</name>
									<description>Edge detect. Detect falling edge if bit 0 in the HILO register is 0. Detect rising edge if bit 0 in the HILO register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAKEUP1_E</name>
							<description>Edge/level detect mode for WAKEUP1 event. The corresponding bit in the EDGE register must be 0.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LEVEL_DETECT_</name>
									<description>Level detect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EDGE_DETECT_DETECT_</name>
									<description>Edge detect. Detect falling edge if bit 1 in the HILO register is 0. Detect rising edge if bit 1 in the HILO register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAKEUP2_E</name>
							<description>Edge/level detect mode for WAKEUP2 event. The corresponding bit in the EDGE register must be 0.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LEVEL_DETECT_</name>
									<description>Level detect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EDGE_DETECT_DETECT_</name>
									<description>Edge detect. Detect falling edge if bit 2 in the HILO register is 0. Detect rising edge if bit 2 in the HILO register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAKEUP3_E</name>
							<description>Edge/level detect mode for WAKEUP3 event. The corresponding bit in the EDGE register must be 0.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LEVEL_DETECT_</name>
									<description>Level detect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EDGE_DETECT_DETECT_</name>
									<description>Edge detect. Detect falling edge if bit 30 in the HILO register is 0. Detect rising edge if bit 3 in the HILO register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ATIMER_E</name>
							<description>Edge/level detect mode for alarm timer event. The corresponding bit in the EDGE register must be 0.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LEVEL_DETECT_</name>
									<description>Level detect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EDGE_DETECT_DETECT_</name>
									<description>Edge detect. Detect falling edge if bit 4 in the HILO register is 0. Detect rising edge if bit 4 in the HILO register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RTC_E</name>
							<description>Edge/level detect mode for RTC event. The corresponding bit in the EDGE register must be 0.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LEVEL_DETECT_</name>
									<description>Level detect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EDGE_DETECT_DETECT_</name>
									<description>Edge detect. Detect falling edge if bit 5 in the HILO register is 0. Detect rising edge if bit 5 in the HILO register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BOD_E</name>
							<description>Edge/level detect mode for BOD event. The corresponding bit in the EDGE register must be 0.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LEVEL_DETECT_</name>
									<description>Level detect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EDGE_DETECT_DETECT_</name>
									<description>Edge detect. Detect falling edge if bit 6 in the HILO register is 0. Detect rising edge if bit 6 in the HILO register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WWDT_E</name>
							<description>Edge/level detect mode for WWDTD event. The corresponding bit in the EDGE register must be 0.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LEVEL_DETECT_</name>
									<description>Level detect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EDGE_DETECT_DETECT_</name>
									<description>Edge detect. Detect falling edge if bit 7 in the HILO register is 0. Detect rising edge if bit 7 in the HILO register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ETH_E</name>
							<description>Edge/level detect mode for ethernet event. The corresponding bit in the EDGE register must be 0.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LEVEL_DETECT_</name>
									<description>Level detect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EDGE_DETECT_DETECT_</name>
									<description>Edge detect. Detect falling edge if bit 8 in the HILO register is 0. Detect rising edge if bit 8 in the HILO register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USB0_E</name>
							<description>Edge/level detect mode for USB0 event. The corresponding bit in the EDGE register must be 0.</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LEVEL_DETECT_</name>
									<description>Level detect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EDGE_DETECT_DETECT_</name>
									<description>Edge detect. Detect falling edge if bit 9 in the HILO register is 0. Detect rising edge if bit 9 in the HILO register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USB1_E</name>
							<description>Edge/level detect mode for USB1 event. The corresponding bit in the EDGE register must be 0.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LEVEL_DETECT_</name>
									<description>Level detect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EDGE_DETECT_DETECT_</name>
									<description>Edge detect. Detect falling edge if bit 10 in the HILO register is 0. Detect rising edge if bit 10 in the HILO register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[11:11]</bitRange>
							
