cmsis-svd/cmsis-svd/data/NXP/LPC18xx_svd_v18.xml
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[6:4]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[7:7]</bitRange>
							
						</field>
						<field>
							<name>ABEOINTEN</name>
							<description>Enables the end of auto-baud interrupt.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE_END_OF_AUTO_</name>
									<description>Disable end of auto-baud Interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_END_OF_AUTO_B</name>
									<description>Enable end of auto-baud Interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ABTOINTEN</name>
							<description>Enables the auto-baud time-out interrupt.</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE_AUTO_BAUD_TI</name>
									<description>Disable auto-baud time-out Interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_AUTO_BAUD_TIM</name>
									<description>Enable auto-baud time-out Interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:10]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>IIR</name>
					<description>Interrupt ID Register. Identifies which interrupt(s) are pending.</description>
					<addressOffset>0x008</addressOffset>
					<access>read-only</access>
					<resetValue>0x01</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INTSTATUS</name>
							<description>Interrupt status.  Note that IIR bit  0 is active low. The pending interrupt can be determined by evaluating IIR bit  3:1.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>AT_LEAST_ONE_INTERRU</name>
									<description>At least one interrupt is pending.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NO_INTERRUPT_IS_PEND</name>
									<description>No interrupt is pending.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INTID</name>
							<description>Interrupt identification.  IER3:1 identifies an interrupt corresponding to the UART Rx FIFO. All other combinations of IER bit  3:1 not listed below are reserved (100,101,111).</description>
							<bitRange>[3:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PRIORITY_1_(HIGHEST)</name>
									<description>Priority 1 (highest) - Receive Line Status (RLS).</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRIORITY_2__RECEIVE</name>
									<description>Priority 2 - Receive Data Available (RDA).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRIORITY_2__CHARACT</name>
									<description>Priority 2 - Character Time-out Indicator (CTI).</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRIORITY_3__THRE_IN</name>
									<description>Priority 3 - THRE Interrupt.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRIORITY_4_(LOWEST)_</name>
									<description>Priority 4 (lowest) - Reserved.</description>
									<value>0x0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[5:4]</bitRange>
							
						</field>
						<field>
							<name>FIFOENABLE</name>
							<description>Copies of FCR bit  0.</description>
							<bitRange>[7:6]</bitRange>
							
						</field>
						<field>
							<name>ABEOINT</name>
							<description>End of auto-baud interrupt.  True if auto-baud has finished successfully and interrupt is enabled.</description>
							<bitRange>[8:8]</bitRange>
							
						</field>
						<field>
							<name>ABTOINT</name>
							<description>Auto-baud time-out interrupt.  True if auto-baud has timed out and interrupt is enabled.</description>
							<bitRange>[9:9]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:10]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>FCR</name>
					<description>FIFO Control Register. Controls UART FIFO usage and modes.</description>
					<alternateRegister>IIR</alternateRegister>
					<addressOffset>0x008</addressOffset>
					<access>write-only</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FIFOEN</name>
							<description>FIFO Enable.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>UART_FIFOS_ARE_DISAB</name>
									<description>UART FIFOs are disabled. Must not be used in the application.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_HIGH_ENABLE_F</name>
									<description>Active high enable for both UART Rx and TX FIFOs and FCR bit  7:1 access. This bit must be set for proper UART operation. Any transition on this bit will automatically clear the UART FIFOs.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXFIFORES</name>
							<description>RX FIFO Reset.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_IMPACT_ON_EITHER_</name>
									<description>No impact on either of UART FIFOs.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WRITING_A_LOGIC_1_TO</name>
									<description>Writing a logic 1 to FCR bit  1 will clear all bytes in UART Rx FIFO, reset the pointer logic. This bit is self-clearing.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXFIFORES</name>
							<description>TX FIFO Reset.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_IMPACT_ON_EITHER_</name>
									<description>No impact on either of UART FIFOs.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WRITING_A_LOGIC_1_TO</name>
									<description>Writing a logic 1 to FCR bit  2 will clear all bytes in UART TX FIFO, reset the pointer logic. This bit is self-clearing.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMAMODE</name>
							<description>DMA Mode Select. When the FIFO enable bit (bit 0 of this register) is set, this bit selects the DMA mode.</description>
							<bitRange>[3:3]</bitRange>
							
