cmsis-svd/cmsis-svd/data/NXP/LPC18xx_svd_v18.xml
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>CR%s</name>
					<description>Capture Register. CR is loaded with the value of TC when there is an event on the CAPn.0 input.</description>
					<addressOffset>0x02C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CAP</name>
							<description>Timer counter capture value.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>EMR</name>
					<description>External Match Register. The EMR controls the external match pins MATn.0-3 (MAT0.0-3 and MAT1.0-3 respectively).</description>
					<addressOffset>0x03C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EM0</name>
							<description>External Match 0. When a match occurs between the TC and MR0, this bit can either toggle, go low, go high, or do nothing, depending on bits 5:4 of this register. This bit can be driven onto a MATn.0 pin, in a positive-logic manner (0 = low, 1 = high).</description>
							<bitRange>[0:0]</bitRange>
							
						</field>
						<field>
							<name>EM1</name>
							<description>External Match 1. When a match occurs between the TC and MR1, this bit can either toggle, go low, go high, or do nothing, depending on bits 7:6 of this register. This bit can be driven onto a MATn.1 pin, in a positive-logic manner (0 = low, 1 = high).</description>
							<bitRange>[1:1]</bitRange>
							
						</field>
						<field>
							<name>EM2</name>
							<description>External Match 2. When a match occurs between the TC and MR2, this bit can either toggle, go low, go high, or do nothing, depending on bits 9:8 of this register. This bit can be driven onto a MATn.0 pin, in a positive-logic manner (0 = low, 1 = high).</description>
							<bitRange>[2:2]</bitRange>
							
						</field>
						<field>
							<name>EM3</name>
							<description>External Match 3. When a match occurs between the TC and MR3, this bit can either toggle, go low, go high, or do nothing, depending on bits 11:10 of this register. This bit can be driven onto a MATn.0 pin, in a positive-logic manner (0 = low, 1 = high).</description>
							<bitRange>[3:3]</bitRange>
							
						</field>
						<field>
							<name>EMC0</name>
							<description>External Match Control 0. Determines the functionality of External Match 0.</description>
							<bitRange>[5:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DO_NOTHING_</name>
									<description>Do Nothing.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_THE_CORRESPOND</name>
									<description>Clear the corresponding External Match bit/output to 0 (MATn.m pin is LOW if pinned out).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET_THE_CORRESPONDIN</name>
									<description>Set the corresponding External Match bit/output to 1 (MATn.m pin is HIGH if pinned out).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_THE_CORRESPON</name>
									<description>Toggle the corresponding External Match bit/output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMC1</name>
							<description>External Match Control 1. Determines the functionality of External Match 1.</description>
							<bitRange>[7:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DO_NOTHING_</name>
									<description>Do Nothing.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_THE_CORRESPOND</name>
									<description>Clear the corresponding External Match bit/output to 0 (MATn.m pin is LOW if pinned out).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET_THE_CORRESPONDIN</name>
									<description>Set the corresponding External Match bit/output to 1 (MATn.m pin is HIGH if pinned out).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_THE_CORRESPON</name>
									<description>Toggle the corresponding External Match bit/output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMC2</name>
							<description>External Match Control 2. Determines the functionality of External Match 2.</description>
							<bitRange>[9:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DO_NOTHING_</name>
									<description>Do Nothing.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_THE_CORRESPOND</name>
									<description>Clear the corresponding External Match bit/output to 0 (MATn.m pin is LOW if pinned out).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET_THE_CORRESPONDIN</name>
									<description>Set the corresponding External Match bit/output to 1 (MATn.m pin is HIGH if pinned out).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_THE_CORRESPON</name>
									<description>Toggle the corresponding External Match bit/output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMC3</name>
							<description>External Match Control 3. Determines the functionality of External Match 3.</description>
							<bitRange>[11:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DO_NOTHING_</name>
									<description>Do Nothing.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_THE_CORRESPOND</name>
									<description>Clear the corresponding External Match bit/output to 0 (MATn.m pin is LOW if pinned out).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET_THE_CORRESPONDIN</name>
									<description>Set the corresponding External Match bit/output to 1 (MATn.m pin is HIGH if pinned out).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_THE_CORRESPON</name>
									<description>Toggle the corresponding External Match bit/output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[15:12]</bitRange>
							
