cmsis-svd/cmsis-svd/data/NXP/LPC18xx_svd_v18.xml
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>SFSCLK_%s</name>
					<description>Pin configuration register for pins CLK</description>
					<addressOffset>0xC00</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MODE</name>
							<description>Select pin function</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>FUNCTION_0_DEFAULT)</name>
									<description>Function 0 (default)</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_1</name>
									<description>Function 1</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_2</name>
									<description>Function 2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_3</name>
									<description>Function 3</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_4</name>
									<description>Function 4</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_5</name>
									<description>Function 5</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_6</name>
									<description>Function 6</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_7</name>
									<description>Function 7</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EPD</name>
							<description>Enable pull-down resistor at pad</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE_PULL_DOWN_</name>
									<description>Disable pull-down.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_PULL_DOWN_</name>
									<description>Enable pull-down.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EPUN</name>
							<description>Disable pull-up resistor at pad. By default, the pull-up resistor is enabled at reset.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLE_PULL_UP</name>
									<description>Enable pull-up</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE_PULL_UP</name>
									<description>Disable pull-up</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EHS</name>
							<description>Slew rate</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SLOW</name>
									<description>Slow</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST</name>
									<description>Fast</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EZI</name>
							<description>Input buffer enable. The input buffer is disabled by default at reset but must be enabled to transfer data from the I/O buffer to the pad.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE_INPUT_BUFFER</name>
									<description>Disable input buffer</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_INPUT_BUFFER</name>
									<description>Enable input buffer</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[7:7]</bitRange>
							
						</field>
						<field>
							<name>EHD</name>
							<description>Select drive strength</description>
							<bitRange>[9:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>STANDARD_DRIVE_4_MA</name>
									<description>Standard drive: 4 mA drive strength</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MEDIUM_DRIVE_8_MA_D</name>
									<description>Medium drive: 8 mA drive strength</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH_DRIVE_14_MA_DR</name>
									<description>High drive: 14 mA drive strength</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ULTRA_HIGH_DRIVE_20</name>
									<description>Ultra-high drive: 20 mA drive strength</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:10]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>ENAIO0</name>
					<description>ADC0 function select register</description>
					<addressOffset>0xC88</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADC0_0</name>
							<description>Select ADC0_0</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ANALOG_FUNCTION_ADC0</name>
									<description>Analog function ADC0_0 selected on pin P4_3.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIGITAL_FUNCTION_SEL</name>
									<description>Digital function selected on pin P4_3.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC0_1</name>
							<description>Select ADC0_1</description>
							<bitRange>[1:1]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>ANALOG_FUNCTION_ADC0</name>
									<description>Analog function ADC0_1 selected on pin P4_1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIGITAL_FUNCTION_SEL</name>
									<description>Digital function selected on pin P4_1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC0_2</name>
							<description>Select ADC0_2</description>
							<bitRange>[2:2]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>ANALOG_FUNCTION_ADC0</name>
									<description>Analog function ADC0_2 selected on pin PF_8.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIGITAL_FUNCTION_SEL</name>
									<description>Digital function selected on pin PF_8.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC0_3</name>
							<description>Select ADC0_3</description>
							<bitRange>[3:3]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>ANALOG_FUNCTION_ADC0</name>
									<description>Analog function ADC0_3 selected on pin P7_5.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIGITAL_FUNCTION_SEL</name>
									<description>Digital function selected on pin P7_5.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC0_4</name>
							<description>Select ADC0_4</description>
							<bitRange>[4:4]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>ANALOG_FUNCTION_ADC0</name>
									<description>Analog function ADC0_4 selected on pin P7_4.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIGITAL_FUNCTION_SEL</name>
									<description>Digital function selected on pin P7_4.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC0_5</name>
							<description>Select ADC0_5</description>
							<bitRange>[5:5]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>ANALOG_FUNCTION_ADC0</name>
									<description>Analog function ADC0_5 selected on pin PF_10.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIGITAL_FUNCTION_SEL</name>
									<description>Digital function selected on pin PF_10.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC0_6</name>
							<description>Select ADC0_6</description>
							<bitRange>[6:6]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>ANALOG_FUNCTION_ADC0</name>
									<description>Analog function ADC0_6 selected on pin PB_6.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIGITAL_FUNCTION_SEL</name>
									<description>Digital function selected on pin PB_6.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ENAIO1</name>
					<description>ADC1 function select register</description>
					<addressOffset>0xC8C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADC1_0</name>
							<description>Select ADC1_0</description>
							<bitRange>[0:0]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>ANALOG_FUNCTION_ADC1</name>
									<description>Analog function ADC1_0 selected on pin PC_3.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIGITAL_FUNCTION_SEL</name>
									<description>Digital function selected on pin PC_3.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC1_1</name>
							<description>Select ADC1_1</description>
							<bitRange>[1:1]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>ANALOG_FUNCTION_ADC1</name>
									<description>Analog function ADC1_1 selected on pin PC_0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIGITAL_FUNCTION_SEL</name>
									<description>Digital function selected on pin PC_0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC1_2</name>
							<description>Select ADC1_2</description>
							<bitRange>[2:2]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>ANALOG_FUNCTION_ADC1</name>
									<description>Analog function ADC1_2 selected on pin PF_9.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIGITAL_FUNCTION_SEL</name>
									<description>Digital function selected on pin PF_9.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC1_3</name>
							<description>Select ADC1_3</description>
							<bitRange>[3:3]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>ANALOG_FUNCTION_ADC1</name>
									<description>Analog function ADC1_3 selected on pin PF_6.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIGITAL_FUNCTION_SEL</name>
									<description>Digital function selected on pin PF_6.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC1_4</name>
							<description>Select ADC1_4</description>
							<bitRange>[4:4]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>ANALOG_FUNCTION_ADC1</name>
									<description>Analog function ADC1_4 selected on pin PF_5.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIGITAL_FUNCTION_SEL</name>
									<description>Digital function selected on pin PF_5.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC1_5</name>
							<description>Select ADC1_5</description>
							<bitRange>[5:5]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>ANALOG_FUNCTION_ADC1</name>
									<description>Analog function ADC1_5 selected on pin PF_11.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIGITAL_FUNCTION_SEL</name>
									<description>Digital function selected on pin PF_11.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC1_6</name>
							<description>Select ADC1_6</description>
							<bitRange>[6:6]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>ANALOG_FUNCTION_ADC1</name>
									<description>Analog function ADC1_6 selected on pin P7_7.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIGITAL_FUNCTION_SEL</name>
									<description>Digital function selected on pin P7_7.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC1_7</name>
							<description>Select ADC1_7</description>
							<bitRange>[7:7]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>ANALOG_FUNCTION_ADC1</name>
									<description>Analog function ADC1_7 selected on pin PF_7.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIGITAL_FUNCTION_SEL</name>
									<description>Digital function selected on pin PF_7.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ENAIO2</name>
					<description>Analog function select register</description>
					<addressOffset>0xC90</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DAC</name>
							<description>Select DAC</description>
							<bitRange>[0:0]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>ANALOG_FUNCTION_DAC_</name>
									<description>Analog function DAC selected on pin P4_4.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIGITAL_FUNCTION_SEL</name>
									<description>Digital function selected on pin P4_4.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BG</name>
							<description>Select bandgap output</description>
							<bitRange>[4:4]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>BANDGAP_OUTPUT_SELEC</name>
									<description>Bandgap output selected for pin PF_7.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIGITAL_FUNCTION_SEL</name>
									<description>Digital function selected on pin PF_7.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SFSUSB</name>
					<description>Pin configuration register for</description>
					<addressOffset>0xC80</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>USB_AIM</name>
							<description>Differential data input AIP/AIM  0 = Going LOW with full speed edge rate 1 = Going HIGH with full speed edge rate</description>
							<bitRange>[0:0]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>GOING_LOW_WITH_FULL_</name>
									<description>Going LOW with full speed edge rate</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GOING_HIGH_WITH_FULL</name>
									<description>Going HIGH with full speed edge rate</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USB_ESEA</name>
							<description>Control signal for differential input or single input</description>
							<bitRange>[1:1]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>RESERVED_DO_NOT_USE</name>
									<description>Reserved. Do not use.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SINGLE_INPUT_AIP_EN</name>
									<description>Single input AIP. Enables USB1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:2]</bitRange>

							
