cmsis-svd/cmsis-svd/data/NXP/LPC18xx_svd_v18.xml
						</field>
					</fields>
				</register>
				<register>
					<name>SFSI2C0</name>
					<description>Pin configuration register for I 2C0-bus pins</description>
					<addressOffset>0xC84</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SDA_EHS</name>
							<description>Configures I2C0-bus speed for SDA0 pin</description>
							<bitRange>[0:0]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>STANDARD/FAST_MODE_</name>
									<description>Standard/Fast mode (400 kbit/s)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH_SPEED_MODE_3_4</name>
									<description>High-speed mode (3.4 Mbit/s)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SCL_EHS</name>
							<description>Configures I2C0-bus speed for SCL0 pin</description>
							<bitRange>[1:1]</bitRange>

							
						</field>


						<field>
							<name>SCL_ECS</name>
							<description>Direction (only applies if SCL_EHS = 1)</description>
							<bitRange>[2:2]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>RECEIVE</name>
									<description>Receive</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TRANSMIT</name>
									<description>Transmit</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>

							
						</field>
					</fields>
				</register>
				<register>
					<name>EMCDELAYCLK</name>
					<description>EMC clock delay register</description>
					<addressOffset>0xD00</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLK0_DELAY</name>
							<description>Delay of the EXTBUS_CLK0 clock output.</description>
							<bitRange>[2:0]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[3:3]</bitRange>

						</field>
						<field>
							<name>CLK1_DELAY</name>
							<description>Delay of the EXTBUS_CLK0 clock output.</description>
							<bitRange>[6:4]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[7:7]</bitRange>

						</field>
						<field>
							<name>CLK2_DELAY</name>
							<description>Delay of the EXTBUS_CLK2 clock output.</description>
							<bitRange>[10:8]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[11:11]</bitRange>

						</field>
						<field>
							<name>CLK3_DELAY</name>
							<description>Delay of the EXTBUS_CLK3 clock output.</description>
							<bitRange>[14:12]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[15:15]</bitRange>

						</field>
						<field>
							<name>CKE0_DELAY</name>
							<description>Delay of the EXTBUS_CKEOUT0 clock enable output.</description>
							<bitRange>[18:16]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[19:19]</bitRange>

						</field>
						<field>
							<name>CKE1_DELAY</name>
							<description>Delay of the EXTBUS_CKEOUT1 clock enable output.</description>
							<bitRange>[22:20]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[23:23]</bitRange>

						</field>
						<field>
							<name>CKE2_DELAY</name>
							<description>Delay of the EXTBUS_CKEOUT2 clock enable output.</description>
							<bitRange>[26:24]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[27:27]</bitRange>

						</field>
						<field>
							<name>CKE3_DELAY</name>
							<description>Delay of the EXTBUS_CKEOUT3 clock enable output.</description>
							<bitRange>[30:28]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:31]</bitRange>

						</field>
					</fields>
				</register>
				
				
				
				
				
				
				
				
				<register>
					<name>PINTSEL0</name>
					<description>Pin interrupt select register for pin interrupts 0 to 3.</description>
					<addressOffset>0xE00</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INTPIN0</name>
							<description>Pint interrupt 0: Select the pin number within the GPIO port selected by the PORTSEL0 bit in this register.</description>
							<bitRange>[4:0]</bitRange>

							
						</field>
						<field>
							<name>PORTSEL0</name>
							<description>Pin interrupt 0: Select the port for the pin number to be selected in the INTPIN0 bits of this register.</description>
							<bitRange>[7:5]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>GPIO_PORT_0</name>
									<description>GPIO Port 0</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_1</name>
									<description>GPIO Port 1</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_2</name>
									<description>GPIO Port 2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_3</name>
									<description>GPIO Port 3</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_4</name>
									<description>GPIO Port 4</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_5</name>
									<description>GPIO Port 5</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_6</name>
									<description>GPIO Port 6</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_7</name>
									<description>GPIO Port 7</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>

						<field>
							<name>INTPIN1</name>
							<description>Pint interrupt 1: Select the pin number within the GPIO port selected by the PORTSEL1 bit in this register.</description>
							<bitRange>[12:8]</bitRange>

							
