cmsis-svd/cmsis-svd/data/NXP/LPC18xx_svd_v18.xml
						</field>
						<field>
							<name>PORTSEL4</name>
							<description>Pin interrupt 4: Select the port for the pin number to be selected in the INTPIN4 bits of this register.</description>
							<bitRange>[7:5]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>GPIO_PORT_0</name>
									<description>GPIO Port 0</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_1</name>
									<description>GPIO Port 1</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_2</name>
									<description>GPIO Port 2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_3</name>
									<description>GPIO Port 3</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_4</name>
									<description>GPIO Port 4</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_5</name>
									<description>GPIO Port 5</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_6</name>
									<description>GPIO Port 6</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_7</name>
									<description>GPIO Port 7</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>

						<field>
							<name>INTPIN5</name>
							<description>Pint interrupt 5: Select the pin number within the GPIO port selected by the PORTSEL5 bit in this register.</description>
							<bitRange>[12:8]</bitRange>

							
						</field>
						<field>
							<name>PORTSEL5</name>
							<description>Pin interrupt 5: Select the port for the pin number to be selected in the INTPIN5 bits of this register.</description>
							<bitRange>[15:13]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>GPIO_PORT_0</name>
									<description>GPIO Port 0</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_1</name>
									<description>GPIO Port 1</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_2</name>
									<description>GPIO Port 2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_3</name>
									<description>GPIO Port 3</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_4</name>
									<description>GPIO Port 4</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_5</name>
									<description>GPIO Port 5</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_6</name>
									<description>GPIO Port 6</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_7</name>
									<description>GPIO Port 7</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>

						<field>
							<name>INTPIN6</name>
							<description>Pint interrupt 6: Select the pin number within the GPIO port selected by the PORTSEL6 bit in this register.</description>
							<bitRange>[20:16]</bitRange>

							
						</field>
						<field>
							<name>PORTSEL6</name>
							<description>Pin interrupt 6: Select the port for the pin number to be selected in the INTPIN6 bits of this register.</description>
							<bitRange>[23:21]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>GPIO_PORT_0</name>
									<description>GPIO Port 0</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_1</name>
									<description>GPIO Port 1</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_2</name>
									<description>GPIO Port 2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_3</name>
									<description>GPIO Port 3</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_4</name>
									<description>GPIO Port 4</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_5</name>
									<description>GPIO Port 5</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_6</name>
									<description>GPIO Port 6</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_7</name>
									<description>GPIO Port 7</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>

						<field>
							<name>INTPIN7</name>
							<description>Pint interrupt 7: Select the pin number within the GPIO port selected by the PORTSEL7 bit in this register.</description>
							<bitRange>[28:24]</bitRange>

							
						</field>
						<field>
							<name>PORTSEL7</name>
							<description>Pin interrupt 7: Select the port for the pin number to be selected in the INTPIN7 bits of this register.</description>
							<bitRange>[31:29]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>GPIO_PORT_0</name>
									<description>GPIO Port 0</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_1</name>
									<description>GPIO Port 1</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_2</name>
									<description>GPIO Port 2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_3</name>
									<description>GPIO Port 3</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_4</name>
									<description>GPIO Port 4</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_5</name>
									<description>GPIO Port 5</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_6</name>
									<description>GPIO Port 6</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO_PORT_7</name>
									<description>GPIO Port 7</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>

					</fields>
				</register>


