cmsis-svd/cmsis-svd/data/NXP/LPC18xx_svd_v18.xml
						</field>
					</fields>
				</register>
				<register>
					<name>VADC_TRIGGER_IN</name>
					<description>ADC trigger  input multiplexer</description>
					<addressOffset>0x060</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOINVERT</name>
									<description>Not inverted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INVERT</name>
									<description>Input inverted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EDGE</name>
							<description>Enable rising edge detection</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOEDGE</name>
									<description>No edge detection.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISINGEDGE</name>
									<description>Rising edge detection enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYNCH</name>
							<description>Enable 2ff synchronization</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable 2ff synchronization.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable 2ff synchronization.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PULSE</name>
							<description>Enable single pulse generation.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable single pulse generation.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable single pulse generation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SELECT</name>
							<description>Select input. Values 0xA to 0xF are reserved.</description>
							<bitRange>[7:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO6_28</name>
									<description>GPIO6[28]</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO5_3</name>
									<description>GPIO5[3]</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reserved</name>
									<description>Reserved</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCOB2</name>
									<description>MCOB2</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CTOUT_0OR T0_MAT0</name>
									<description>CTOUT_0 or T0_MAT0</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CTOUT_8ORT2_MAT0</name>
									<description>CTOUT_8 or T2_MAT0</description>
									<value>0x7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T0_MAT0</name>
									<description>T0_MAT0</description>
									<value>0x8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T2_MAT0</name>
									<description>T2_MAT0</description>
									<value>0x9</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:8]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>EVENTROUTER_13_IN</name>
					<description>Event router   input 13  multiplexer</description>
					<addressOffset>0x064</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOINVERT</name>
									<description>Not inverted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INVERT</name>
									<description>Input inverted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EDGE</name>
							<description>Enable rising edge detection</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOEDGE</name>
									<description>No edge detection.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISINGEDGE</name>
									<description>Rising edge detection enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYNCH</name>
							<description>Enable 2ff synchronization</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable 2ff synchronization.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable 2ff synchronization.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PULSE</name>
							<description>Enable single pulse generation.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable single pulse generation.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable single pulse generation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SELECT</name>
							<description>Select input. Values 0x3 to 0xF are reserved.</description>
							<bitRange>[7:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CTOUT_2ORT0_MAT2</name>
									<description>CTOUT_2 or T0_MAT2</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T0_MAT2</name>
									<description>T0_MAT2</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:8]</bitRange>

							
