cmsis-svd/cmsis-svd/data/NXP/LPC18xx_svd_v18.xml
						</field>
						<field>
							<name>START</name>
							<description>When the BURST bit is 0, these bits control whether and when an A/D conversion is started (also see Figure 56):</description>
							<bitRange>[26:24]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_START_(THIS_VALUE</name>
									<description>No start (this value should be used when clearing PDN to 0).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>START_CONVERSION_NOW</name>
									<description>Start conversion now.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CTOUT_15</name>
									<description>Start conversion when the edge selected by bit 27 occurs on CTOUT_15 (combined timer output 15).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CTOUT_8</name>
									<description>Start conversion when the edge selected by bit 27 occurs on CTOUT_8 (combined timer output 8).</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCTRIG0</name>
									<description>Start conversion when the edge selected by bit 27 occurs on ADCTRIG0 input.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCTRIG1</name>
									<description>Start conversion when the edge selected by bit 27 occurs on ADCTRIG1 input.</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCOA2</name>
									<description>Start conversion when the edge selected by bit 27 occurs on Motocon PWM output MCOA2.</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED_</name>
									<description>Reserved.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EDGE</name>
							<description>This bit is significant only when the START field contains 0x2 -0x6. In these cases:</description>
							<bitRange>[27:27]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>RISING</name>
									<description>Start conversion on a rising edge on the selected signal.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALLING</name>
									<description>Start conversion on a falling edge on the selected signal.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:28]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>GDR</name>
					<description>A/D Global Data Register. Contains the result of the most recent A/D conversion.</description>
					<addressOffset>0x004</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. These bits always read as zeroes.</description>
							<bitRange>[5:0]</bitRange>
						</field>
						<field>
							<name>V_VREF</name>
							<description>When DONE is 1, this field contains a binary fraction representing the voltage on the ADCn pin selected by the SEL field, divided by the reference voltage on the VDDA pin. Zero in the field indicates that the voltage on the ADCn input pin was less than, equal to, or close to that on VSSA, while 0x3FF indicates that the voltage on ADCn input pin was close to, equal to, or greater than that on VDDA.</description>
							<bitRange>[15:6]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. These bits always read as zeroes.</description>
							<bitRange>[23:16]</bitRange>
						</field>
						<field>
							<name>CHN</name>
							<description>These bits contain the channel from which the LS bits were converted.</description>
							<bitRange>[26:24]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. These bits always read as zeroes.</description>
							<bitRange>[29:27]</bitRange>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>This bit is 1 in burst mode if the results of one or more conversions was (were) lost and overwritten before the conversion that produced the result in the V_VREF bits.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>DONE</name>
							<description>This bit is set to 1 when an analog-to-digital conversion completes. It is cleared when this register is read and when the AD0/1CR register is written. If the AD0/1CR is written while a conversion is still in progress, this bit is set and a new conversion is started.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INTEN</name>
					<description>A/D Interrupt Enable Register. This register contains enable bits that allow the DONE flag of each A/D channel to be included or excluded from contributing to the generation of an A/D interrupt.</description>
					<addressOffset>0x00C</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000100</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADINTEN</name>
							<description>These bits allow control over which A/D channels generate interrupts for conversion completion. When bit 0 is one, completion of a conversion on A/D channel 0 will generate an interrupt, when bit 1 is one, completion of a conversion on A/D channel 1 will generate an interrupt, etc.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>ADGINTEN</name>
							<description>When 1, enables the global DONE flag in ADDR to generate an interrupt. When 0, only the individual A/D channels enabled by ADINTEN 7:0 will generate interrupts.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Always 0.</description>
							<bitRange>[31:9]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>0x04</dimIncrement>
					<dimIndex>0-7</dimIndex>
					<name>DR%s</name>
					<description>A/D Channel Data Register. This register contains the result of the most recent conversion completed on channel n.</description>
					<addressOffset>0x010</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Always 0.</description>
							<bitRange>[5:0]</bitRange>
						</field>
						<field>
							<name>V_VREF</name>
							<description>When DONE is 1, this field contains a binary fraction representing the voltage on the ADCn input pin selected in Table 727, divided by the voltage on the VDDA pin. Zero in the field indicates that the voltage on the ADCn input pin was less than, equal to, or close to that on VDDA, while 0x3FF indicates that the voltage on ADCn input pin was close to, equal to, or greater than that on VDDA.</description>
							<bitRange>[15:6]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Always 0.</description>
							<bitRange>[29:16]</bitRange>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>This bit is 1 in burst mode if the results of one or more conversions was (were) lost and overwritten before the conversion that produced the result in the V_VREF bits in this register.This bit is cleared by reading this register.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>DONE</name>
							<description>This bit is set to 1 when an A/D conversion completes. It is cleared when this register is read.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STAT</name>
					<description>A/D Status Register. This register contains DONE and OVERRUN flags for all of the A/D channels, as well as the A/D interrupt flag.</description>
					<addressOffset>0x030</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DONE</name>
							<description>These bits mirror the DONE status flags that appear in the result register for each A/D channel.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>OVERUN</name>
							<description>These bits mirror the OVERRRUN status flags that appear in the result register for each A/D channel. Reading ADSTAT allows checking the status of all A/D channels simultaneously.</description>
							<bitRange>[15:8]</bitRange>
						</field>
						<field>
							<name>ADINT</name>
							<description>This bit is the A/D interrupt flag. It is one when any of the individual A/D channel Done flags is asserted and enabled to contribute to the A/D interrupt via the ADINTEN register.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Always 0.</description>
							<bitRange>[31:17]</bitRange>
						</field>
					</fields>
				</register>
